In [3]:
import numpy as np
import pandas as pd

In [4]:
data = {'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
       'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
       'Sales':[200,120,340,124,243,350]}

df = pd.DataFrame(data)

In [7]:
#Now you can use the .groupby() method to group rows together based off of a column name. For instance let's group based off of Company. This will create a DataFrameGroupBy object
print(df.groupby('Company'))

by_comp = df.groupby("Company")

<pandas.core.groupby.generic.DataFrameGroupBy object at 0x000001E5811CB280>

In [8]:
#calling aggregate functions off the object
by_comp.mean()

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

In [9]:
#doing all this is 1 line
df.groupby('Company').mean()

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

In [13]:
# more aggregate funtions are

print(by_comp.std(),'\n\n')
print(by_comp.min(),'\n\n')
print(by_comp.max(),'\n\n')
print(by_comp.count(),'\n\n')
print(by_comp.describe(),'\n\n')
print(by_comp.describe().transpose(),'\n\n')
print(by_comp.describe().transpose()['GOOG'])

              Sales
Company
FB        75.660426
GOOG      56.568542
MSFT     152.735065


          Person  Sales
Company
FB          Carl    243
GOOG     Charlie    120
MSFT         Amy    124


          Person  Sales
Company
FB         Sarah    350
GOOG         Sam    200
MSFT     Vanessa    340


         Person  Sales
Company
FB            2      2
GOOG          2      2
MSFT          2      2


        Sales
        count   mean         std    min     25%    50%     75%    max
Company
FB        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOG      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0


Company              FB        GOOG        MSFT
Sales count    2.000000    2.000000    2.000000
      mean   296.500000  160.000000  232.000000
      std     75.660426   56.568542  152.735065
      min    243.000000  120.000000  124.000000
      25%    269.750000  140.000000  178.000000
      50%    296.500000  160.000000  232.000000
      75%    323.250000  180.000000  286.000000
      max    350.000000  200.000000  340.000000


Sales  count      2.000000
       mean     160.000000
       std       56.568542
       min      120.000000
       25%      140.000000
       50%      160.000000
       75%      180.000000
       max      200.000000
Name: GOOG, dtype: float64